import draft from "@/assets/images/copy-dynamic-premium.png";
import card from "@/assets/images/card-dynamic-premium.png";
import wallet from "@/assets/images/wallet-dynamic-premium.png";

export const dictionary = {
  ru: {
    home: "Главная",
    about: "О системе",
    howToPay: "Как оплатить",
    connecting: "Подключение",
    account: "Личный кабинет",
    //
    heroTitle: "Быстрые и безопасные QR-платежи с Altyn Pay",
    heroSubtitle:
      "Оплачивайте товары и услуги мгновенно без наличных, карт и комиссий!",
    connectBusiness: "Подключить бизнес",
    instantPayments: "Мгновенные платежи с Altyn Pay",
    commissionTitle: "Какой % комиссии для вашего бизнеса",
    commissionSubtitle: "Ставка ниже, чем за эквайринг",
    //
    featuresSubtitle: "Особенности",
    featuresTitleLine1: "Преимущества",
    featuresTitleLine2: "Системы быстрых платежей",
    saveOnAcquiringTitle: "Экономия на эквайринге",
    saveOnAcquiringDesc:
      "Принимайте безналичную оплату без карт от клиентов разных банков и экономьте на эквайринге",
    speedTitle: "Скорость",
    speedDesc: "Ведите бизнес без кассовых разрывов",
    quickIntegrationTitle: "Быстрое внедрение",
    quickIntegrationDesc: "Можно начать принимать оплату хоть за один день.",
    securityTitle: "Безопасность",
    securityDesc:
      "Нет передачи карты в чужие руки, снижается риск кражи данных",
    lowerCostsTitle: "Сокращение расходов",
    lowerCostsDesc:
      "Altyn Pay — современная альтернатива эквайрингу: терминал и оборудование не обязательны",
    //
    // Info.tsx – кастомный контент для слайдов
    infoSection: {
      infoSubtitle: "Инновации и качество",
      infoTitleLine1: "Наши продукты",
      infoTitleLine2: "для вашего комфорта",
      slides: [
        {
          title: "Эргономичный дизайн",
          description:
            "Наши изделия разработаны с учетом современных требований к комфорту и функциональности. Каждая деталь продумана для вашего удобства при повседневном использовании.",
          buttons: ["Дизайн", "Комфорт", "Эргономика"],
        },
        {
          title: "Высококачественные материалы",
          description:
            "Мы используем только проверенные материалы премиум-класса, которые обеспечивают долговечность и надежность наших изделий даже при интенсивном использовании.",
          buttons: ["Качество", "Премиум", "Долговечность"],
        },
        {
          title: "Функциональность на каждый день",
          description:
            "Продуманные отделения, карманы и держатели позволяют организовать пространство и хранить все необходимые вещи в идеальном порядке, экономя ваше время.",
          buttons: ["Практичность", "Организация", "Удобство"],
        },
        {
          title: "Стильное решение для города",
          description:
            "Современный дизайн наших продуктов идеально дополнит ваш городской образ, подчеркнув индивидуальность и следование актуальным трендам.",
          buttons: ["Стиль", "Тренд", "Городской"],
        },
      ],
    },
    //
    connectingSubtitle: "Пару кликов",
    connectingTitle: "Как подключиться?",
    connectingButton: "Подключить бизнес",
    connectingSteps: [
      {
        icon: draft,
        text: "Оставьте заявку на подключение в вашем расчётном банке",
      },
      {
        icon: card,
        text: "Выберите удобный способ установки сервиса из предложенных банком",
      },
      {
        icon: wallet,
        text: "Начинайте принимать платежи удобными способами, экономить и зарабатывать больше",
      },
    ],
    //
    workingSubtitle: "Работа",
    workingTitle: "Как работает Altyn Pay",
    calculated: "Рассчитано",
    commissionText:
      "Комиссия за приём платежей в несколько раз дешевле эквайринга!",
    commissionDescription:
      "Магазин с заработком 2 млн рублей в месяц заплатил бы 50 тысяч банку за эквайринг, но в нем настроен приём платежей по СБП, поэтому комиссия составила только 14 тысяч.",
    guaranteed: "Гарантировано",
    instantTransfer: "Средства на расчётный счёт поступают мгновенно",
    instantTransferDescription:
      "Вам не потребуется ждать поступления от клиентов, с СБП вы будете работать без кассовых разрывов.",
    //
    contactTitle: "Остались вопросы?",
    contactDescription:
      "Если в вашем банке вам не ответили на все вопросы, свяжитесь с нами любым удобным способом.",
    placeholderName: "Имя",
    placeholderEmail: "Электронная почта",
    placeholderQuestion: "Ваш вопрос",
    privacyPolicy:
      "Я подтверждаю ознакомление с Политикой обработки персональных данных и даю согласие на обработку персональных данных в порядке и на условиях, указанных в Политике.",
    submitButton: "Задать вопрос",
    //
    aboutSystem: "О системе",
    pricing: "Тарифы",
    connection: "Подключение",
    contacts: "Контакты",
    telegram: "Telegram",
    whatsapp: "WhatsApp",
  },
  kg: {
    home: "Башкы бет",
    about: "Система жөнүндө",
    howToPay: "Кантип төлөөгө болот",
    connecting: "Туташтыруу",
    account: "Жеке кабинет",
    //
    heroTitle: "Altyn Pay менен ыкчам жана коопсуз QR төлөмдөр",
    heroSubtitle:
      "Накталай акчасыз, картасыз жана комиссиясыз товарларды жана кызматтарды дароо төлөңүз!",
    connectBusiness: "Бизнесиңизди кошуңуз",
    instantPayments: "Altyn Pay менен дароо төлөмдөр",
    commissionTitle: "Бизнесиңиз үчүн комиссиянын пайызы",
    commissionSubtitle: "Эквайрингге караганда төмөн",
    //
    featuresSubtitle: "Өзгөчөлүктөрү",
    featuresTitleLine1: "Артыкчылыктары",
    featuresTitleLine2: "Тез төлөм системасынын",
    saveOnAcquiringTitle: "Эквайрингден үнөмдөө",
    saveOnAcquiringDesc:
      "Ар кандай банктын кардарларынан карта колдонбостон төлөм алып, эквайрингден үнөмдөңүз",
    speedTitle: "Ылдамдык",
    speedDesc: "Бизнесиңизди кассалык үзгүлтүктөрсүз жүргүзүңүз",
    quickIntegrationTitle: "Тез интеграция",
    quickIntegrationDesc:
      "Бир күндүн ичинде эле төлөм кабыл ала баштасаңыз болот",
    securityTitle: "Коопсуздук",
    securityDesc:
      "Картаңыз башка бирөөнүн колуна тийбейт, маалымат уурдоо коркунучу төмөндөйт",
    lowerCostsTitle: "Чыгымдарды азайтуу",
    lowerCostsDesc:
      "Altyn Pay — бул эквайрингге заманбап альтернатива: терминал жана жабдык талап кылынбайт",
    //
    infoSection: {
      infoSubtitle: "Инновация жана сапат",
      infoTitleLine1: "Биздин өнүмдөр",
      infoTitleLine2: "сиздин ыңгайлуулук үчүн",
      slides: [
        {
          title: "Эргономикалык дизайн",
          description:
            "Биздин буюмдар заманбап ыңгайлуулук жана функционалдуулук талаптарына ылайык иштелип чыккан. Ар бир майда-барат күнүмдүк колдонууңуз үчүн ойлонулган.",
          buttons: ["Дизайн", "Ыңгайлуулук", "Эргономика"],
        },
        {
          title: "Жогорку сапаттагы материалдар",
          description:
            "Биз эң жогорку сапаттагы текшерилген материалдарды колдонобуз, алар күнүмдүк активдүү колдонууда да бышыктыгын жана ишенимдүүлүгүн камсыз кылат.",
          buttons: ["Сапат", "Премиум", "Бышыктык"],
        },
        {
          title: "Күнүмдүк колдонуу үчүн функционалдуулук",
          description:
            "Кесиптүү ойлонулган бөлүктөр, чөнтөктөр жана кармагычтар баардык керектүү нерселерди тартипке келтирип сактоого жардам берет, убактыңызды үнөмдөйт.",
          buttons: ["Практикалык", "Тартип", "Ыңгайлуулук"],
        },
        {
          title: "Шаар үчүн стилдүү чечим",
          description:
            "Биздин буюмдардын заманбап дизайны шаардык образыңызды толуктайт, жеке стилиңизди жана тренддерди ээрчигениңизди көрсөтөт.",
          buttons: ["Стиль", "Тренд", "Шаардык"],
        },
      ],
    },
    //
    connectingSubtitle: "Бир нече баскычта",
    connectingTitle: "Кантип туташууга болот?",
    connectingButton: "Бизнести туташтыруу",
    connectingSteps: [
      {
        icon: draft,
        text: "Сиздин эсептөөчү банкта туташтыруу боюнча арыз калтырыңыз",
      },
      {
        icon: card,
        text: "Банк сунуштаган ыңгайлуу орнотууну тандаңыз",
      },
      {
        icon: wallet,
        text: "Платеждерди кабыл алып, үнөмдөп, көбүрөөк киреше табыңыз",
      },
    ],
    //
    workingSubtitle: "Жумуш",
    workingTitle: "Altyn Pay кантип иштейт",
    calculated: "Жөнөтүлгөн",
    commissionText:
      "Төлөмдөрдү кабыл алуу комиссиясы эквайрингден бир нече эсе арзан!",
    commissionDescription:
      "Ай сайын 2 млн рубль киреше тапкан магазин эквайринг үчүн банкка 50 миң төлөшү керек болор эле, бирок ал жерде СБП аркылуу төлөм кабыл алуу орнотулган, ошондуктан комиссия болгону 14 миң болду.",
    guaranteed: "Кепилденген",
    instantTransfer: "Акча эсепке дароо түшөт",
    instantTransferDescription:
      "Клиенттерден акча түшүүсүн күтүүгө муктаж болбойсуз, СБП менен сиз кассалык ажырымсыз иштейт болосуз.",
    //
    contactTitle: "Суроолоруңуз калдыбы?",
    contactDescription:
      "Эгер банкыңызда бардык суроолоруңузга жооп албасаңыз, биз менен каалаган ыкма менен байланышсаңыз болот.",
    placeholderName: "Аты-жөнүңүз",
    placeholderEmail: "Электрондук почтаңыз",
    placeholderQuestion: "Сурооңуз",
    privacyPolicy:
      "Мен жеке маалыматтарды иштетүү саясаты менен тааныштымын жана ошол саясатта көрсөтүлгөн тартипте жана шарттарда жеке маалыматтарды иштетүүгө макулмун.",
    submitButton: "Суроо жиберүү",
    //
    aboutSystem: "Жүйө жөнүндө",
    pricing: "Тарифтер",
    connection: "Байланыш",
    contacts: "Контакты",
    telegram: "Telegram",
    whatsapp: "WhatsApp",
  },
};
