import draft from "@/assets/images/copy-dynamic-premium.png";
import card from "@/assets/images/card-dynamic-premium.png";
import wallet from "@/assets/images/wallet-dynamic-premium.png";

export const dictionary = {
  ru: {
    home: "Главная",
    about: "О системе",
    howToPay: "Как оплатить",
    connecting: "Подключение",
    account: "Личный кабинет",
    //
    heroTitle: "Быстрые и безопасные QR-платежи с Altyn Pay",
    heroSubtitle:
      "Оплачивайте товары и услуги мгновенно без наличных, карт и комиссий!",
    connectBusiness: "Подключить бизнес",
    instantPayments: "Мгновенные платежи с Altyn Pay",
    commissionTitle: "Какой % комиссии для вашего бизнеса",
    commissionSubtitle: "Ставка ниже, чем за эквайринг",
    //
    featuresSubtitle: "Особенности",
    featuresTitleLine1: "Преимущества",
    featuresTitleLine2: "Системы быстрых платежей",
    saveOnAcquiringTitle: "Экономия на эквайринге",
    saveOnAcquiringDesc:
      "Принимайте безналичную оплату без карт от клиентов разных банков и экономьте на эквайринге",
    speedTitle: "Скорость",
    speedDesc: "Ведите бизнес без кассовых разрывов",
    quickIntegrationTitle: "Быстрое внедрение",
    quickIntegrationDesc: "Можно начать принимать оплату хоть за один день.",
    securityTitle: "Безопасность",
    securityDesc:
      "Нет передачи карты в чужие руки, снижается риск кражи данных",
    lowerCostsTitle: "Сокращение расходов",
    lowerCostsDesc:
      "Altyn Pay — современная альтернатива эквайрингу: терминал и оборудование не обязательны",
    //
    infoSubtitle: "Подходим ли мы вам?",
    infoTitleLine1: "Для каких бизнесов",
    infoTitleLine2: "мы подходим",
    //
    slides: [
      {
        title: "Маркетплейсы Интернет магазины",
        description:
          "Принимайте платежи без границ! AltynPay осуществляет виртуальный расчет товаров и услуг, быстрые и безопасные транзакции для электронной коммерции.",
        buttons: [
          "Платежи без границ",
          "Платежи без границ",
          "Платежи без границ",
        ],
      },
      {
        title: "Маркетплейсы Интернет магазины",
        description:
          "Принимайте платежи без границ! AltynPay осуществляет виртуальный расчет товаров и услуг, быстрые и безопасные транзакции для электронной коммерции.",
        buttons: [
          "Платежи без границ",
          "Платежи без границ",
          "Платежи без границ",
        ],
      },
      {
        title: "Маркетплейсы Интернет магазины",
        description:
          "Принимайте платежи без границ! AltynPay осуществляет виртуальный расчет товаров и услуг, быстрые и безопасные транзакции для электронной коммерции.",
        buttons: [
          "Платежи без границ",
          "Платежи без границ",
          "Платежи без границ",
        ],
      },
    ],
    //
    connectingSubtitle: "Пару кликов",
    connectingTitle: "Как подключиться?",
    connectingButton: "Подключить бизнес",
    connectingSteps: [
      {
        icon: draft,
        text: "Оставьте заявку на подключение в вашем расчётном банке",
      },
      {
        icon: card,
        text: "Выберите удобный способ установки сервиса из предложенных банком",
      },
      {
        icon: wallet,
        text: "Начинайте принимать платежи удобными способами, экономить и зарабатывать больше",
      },
    ],
    //
    workingSubtitle: "Работа",
    workingTitle: "Как работает Altyn Pay",
    calculated: "Рассчитано",
    commissionText:
      "Комиссия за приём платежей в несколько раз дешевле эквайринга!",
    commissionDescription:
      "Магазин с заработком 2 млн рублей в месяц заплатил бы 50 тысяч банку за эквайринг, но в нем настроен приём платежей по СБП, поэтому комиссия составила только 14 тысяч.",
    guaranteed: "Гарантировано",
    instantTransfer: "Средства на расчётный счёт поступают мгновенно",
    instantTransferDescription:
      "Вам не потребуется ждать поступления от клиентов, с СБП вы будете работать без кассовых разрывов.",
    //
    contactTitle: "Остались вопросы?",
    contactDescription:
      "Если в вашем банке вам не ответили на все вопросы, свяжитесь с нами любым удобным способом.",
    placeholderName: "Имя",
    placeholderEmail: "Электронная почта",
    placeholderQuestion: "Ваш вопрос",
    privacyPolicy:
      "Я подтверждаю ознакомление с Политикой обработки персональных данных и даю согласие на обработку персональных данных в порядке и на условиях, указанных в Политике.",
    submitButton: "Задать вопрос",
    //
    aboutSystem: "О системе",
    pricing: "Тарифы",
    connection: "Подключение",
    contacts: "Контакты",
    telegram: "Telegram",
    whatsapp: "WhatsApp",
  },
  kg: {
    home: "Башкы бет",
    about: "Система жөнүндө",
    howToPay: "Кантип төлөөгө болот",
    connecting: "Туташтыруу",
    account: "Жеке кабинет",
    //
    heroTitle: "Altyn Pay менен ыкчам жана коопсуз QR төлөмдөр",
    heroSubtitle:
      "Накталай акчасыз, картасыз жана комиссиясыз товарларды жана кызматтарды дароо төлөңүз!",
    connectBusiness: "Бизнесиңизди кошуңуз",
    instantPayments: "Altyn Pay менен дароо төлөмдөр",
    commissionTitle: "Бизнесиңиз үчүн комиссиянын пайызы",
    commissionSubtitle: "Эквайрингге караганда төмөн",
    //
    featuresSubtitle: "Өзгөчөлүктөрү",
    featuresTitleLine1: "Артыкчылыктары",
    featuresTitleLine2: "Тез төлөм системасынын",
    saveOnAcquiringTitle: "Эквайрингден үнөмдөө",
    saveOnAcquiringDesc:
      "Ар кандай банктын кардарларынан карта колдонбостон төлөм алып, эквайрингден үнөмдөңүз",
    speedTitle: "Ылдамдык",
    speedDesc: "Бизнесиңизди кассалык үзгүлтүктөрсүз жүргүзүңүз",
    quickIntegrationTitle: "Тез интеграция",
    quickIntegrationDesc:
      "Бир күндүн ичинде эле төлөм кабыл ала баштасаңыз болот",
    securityTitle: "Коопсуздук",
    securityDesc:
      "Картаңыз башка бирөөнүн колуна тийбейт, маалымат уурдоо коркунучу төмөндөйт",
    lowerCostsTitle: "Чыгымдарды азайтуу",
    lowerCostsDesc:
      "Altyn Pay — бул эквайрингге заманбап альтернатива: терминал жана жабдык талап кылынбайт",
    //
    infoSubtitle: "Биз сизге ылайыктубузбу?",
    infoTitleLine1: "Кайсы бизнес үчүн",
    infoTitleLine2: "биз ылайыктуубуз",
    //
    slides: [
      {
        title: "Маркетплейстер Интернет дүкөндөр",
        description:
          "Чектөөсүз төлөмдөрдү кабыл алыңыз! AltynPay товарлар жана кызматтар үчүн виртуалдык эсептешүүлөрдү, тез жана коопсуз транзакцияларды камсыз кылат.",
        buttons: [
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
        ],
      },
      {
        title: "Маркетплейстер Интернет дүкөндөр",
        description:
          "Чектөөсүз төлөмдөрдү кабыл алыңыз! AltynPay товарлар жана кызматтар үчүн виртуалдык эсептешүүлөрдү, тез жана коопсуз транзакцияларды камсыз кылат.",
        buttons: [
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
        ],
      },
      {
        title: "Маркетплейстер Интернет дүкөндөр",
        description:
          "Чектөөсүз төлөмдөрдү кабыл алыңыз! AltynPay товарлар жана кызматтар үчүн виртуалдык эсептешүүлөрдү, тез жана коопсуз транзакцияларды камсыз кылат.",
        buttons: [
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
          "Чек арасыз төлөмдөр",
        ],
      },
    ],
    //
    connectingSubtitle: "Бир нече баскычта",
    connectingTitle: "Кантип туташууга болот?",
    connectingButton: "Бизнести туташтыруу",
    connectingSteps: [
      {
        icon: "/icons/form-icon.svg",
        text: "Сиздин эсептөөчү банкта туташтыруу боюнча арыз калтырыңыз",
      },
      {
        icon: "/icons/card-icon.svg",
        text: "Банк сунуштаган ыңгайлуу орнотууну тандаңыз",
      },
      {
        icon: "/icons/wallet-icon.svg",
        text: "Платеждерди кабыл алып, үнөмдөп, көбүрөөк киреше табыңыз",
      },
    ],
    //
    workingSubtitle: "Жумуш",
    workingTitle: "Altyn Pay кантип иштейт",
    calculated: "Жөнөтүлгөн",
    commissionText:
      "Төлөмдөрдү кабыл алуу комиссиясы эквайрингден бир нече эсе арзан!",
    commissionDescription:
      "Ай сайын 2 млн рубль киреше тапкан магазин эквайринг үчүн банкка 50 миң төлөшү керек болор эле, бирок ал жерде СБП аркылуу төлөм кабыл алуу орнотулган, ошондуктан комиссия болгону 14 миң болду.",
    guaranteed: "Кепилденген",
    instantTransfer: "Акча эсепке дароо түшөт",
    instantTransferDescription:
      "Клиенттерден акча түшүүсүн күтүүгө муктаж болбойсуз, СБП менен сиз кассалык ажырымсыз иштейт болосуз.",
    //
    contactTitle: "Суроолоруңуз калдыбы?",
    contactDescription:
      "Эгер банкыңызда бардык суроолоруңузга жооп албасаңыз, биз менен каалаган ыкма менен байланышсаңыз болот.",
    placeholderName: "Аты-жөнүңүз",
    placeholderEmail: "Электрондук почтаңыз",
    placeholderQuestion: "Сурооңуз",
    privacyPolicy:
      "Мен жеке маалыматтарды иштетүү саясаты менен тааныштымын жана ошол саясатта көрсөтүлгөн тартипте жана шарттарда жеке маалыматтарды иштетүүгө макулмун.",
    submitButton: "Суроо жиберүү",
    //
    aboutSystem: "Жүйө жөнүндө",
    pricing: "Тарифтер",
    connection: "Байланыш",
    contacts: "Контакты",
    telegram: "Telegram",
    whatsapp: "WhatsApp",
  },
};
